#include <stdio.h>

int main(){
    float a = 0.617;  // กำหนดตัวแปร a โดยใช้ float เพราะเป็นเลขทศนิยม
    int b = 25;       // กำหนดตัวแปร b โดยใช้ int เพราะเป็นเลขจำนวนเต็ม
    float c = 19.000;  // กำหนดตัวแปร c โดยใช้ float เพราะเป็นเลขทศนิยม
    int d = 9;           // กำหนดตัวแปร d โดยใช้ int เพราะเป็นเลขจำนวนเต็ม
    float e = 124.555;  // กำหนดตัวแปร e โดยใช้ float เพราะเป็นเลขทศนิยม
    float f = 0.001;     // กำหนดตัวแปร f โดยใช้ float เพราะเป็นเลขทศนิยม


    printf("a=%6.3f%%\n",a); // ช่องกว้าง 6 ช่องทศนิยม 3 ตำแหน่งและชิดขวา      
    printf("b=%4d%%\n", b);  // ช่องกว้าง 4 ช่อง และชิดขวา                               
    printf("c =%6.3f%%\n", c); // ข่องกว้าง 6 ช่อง ทศนิยม 3 ตำแหน่งและชิดขวา
    printf("d  =%-2d%%\n", d); // ช่องกว้าง 2 ช่อง ติดลบ เลยชิดซ้าย
    printf("e=%7.3f%%\n", e); // ช่องกว้าง 7 ช่อง ทศนิยม 3 ตำแหน่ง และชิดขวา
    printf("f=%5.3f%%\n", f); // ช่องกว้าง 5 ช่อง ทศนิยม 3 ตำแหน่ง และชิดขวา
    return 0;

}